bin/main/com/lld/uml/sequence-diagram-notification.puml
@startuml

participant Client
participant Subject
participant Observer

Client -> Subject: setState()
Subject -> Subject: notifyObservers()
Subject -> Observer: update()

@enduml
