src/main/java/com/lld/uml/uml.md
```mermaid
sequenceDiagram
    participant Client
    participant Subject
    participant Observer

    Client->>Subject: setState()
    Subject->>Subject: notifyObservers()
    Subject->>Observer: update()
```
